Samsung/TizenRT/os/board/rtl8721csm/src/component/os/tizenrt/tizenrt_service.c
/******************************************************************************
 * Copyright (c) 2013-2016, Realtek Semiconductor Corp.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 ******************************************************************************/

#include <osdep_service.h>
#include <stdio.h>
#include "rtl8721d_cache.h"
#include <tinyara/sched.h>
#include "../../../kernel/sched/sched.h"
/********************* os depended utilities ********************/

#ifndef USE_MUTEX_FOR_SPINLOCK
#define USE_MUTEX_FOR_SPINLOCK 1
#endif

#if defined(CONFIG_PLATFORM_TIZENRT_OS)
#define USE_PTHREAD_MUTEX 0		//todo
#endif

/******************************************************************************
 *                    Misc Function
 ******************************************************************************/
extern void timer_wrapper(_timerHandle timer_hdl);


struct _tizenrt_timer_entry {
	struct list_head list;
	struct timer_list_priv *timer;
};

static _list _tizenrt_timer_table;
static u8 _tizenrt_timer_table_init = 0;
static _mutex _tizenrt_timer_mutex = NULL;

static irqstate_t initial_tizen_flags, up_tizen_flag;
static int flagcnt = 0;
void save_and_cli()
{
       if(flagcnt){
               up_tizen_flag = irqsave();
       }else{
               initial_tizen_flags = irqsave();
       }
       flagcnt++;
}

void restore_flags()
{
       flagcnt--;
       if(flagcnt){
               irqrestore(up_tizen_flag);
       }else{
               irqrestore(initial_tizen_flags);
       }
}

void cli()
{
}

/* Not needed on 64bit architectures */
static unsigned int __div64_32(u64 *n, unsigned int base)
{
	u64 rem = *n;
	u64 b = base;
	u64 res, d = 1;
	unsigned int high = rem >> 32;

	/* Reduce the thing a bit first */
	res = 0;
	if (high >= base) {
		high /= base;
		res = (u64) high << 32;
		rem -= (u64)(high * base) << 32;
	}

	while ((u64) b > 0 && b < rem) {
		b = b + b;
		d = d + d;
	}

	do {
		if (rem >= b) {
			rem -= b;
			res += d;
		}
		b >>= 1;
		d >>= 1;
	} while (d);

	*n = res;
	return rem;
}

u32 _tizenrt_end_of_queue_search(_list *head, _list *plist)
{
	if (head == plist)
		return _TRUE;
	else
		return _FALSE;
}

static void _tizenrt_mutex_get(_mutex *plock);
static void _tizenrt_mutex_put(_lock *plock);
void _tizenrt_timer_wrapper(void *timer)
{
	_list *plist;
	struct _tizenrt_timer_entry *timer_entry = NULL;

	_tizenrt_mutex_get(&_tizenrt_timer_mutex);
	plist = get_next(&_tizenrt_timer_table);
	while ((_tizenrt_end_of_queue_search(&_tizenrt_timer_table, plist)) == _FALSE) {
		timer_entry = LIST_CONTAINOR(plist, struct _tizenrt_timer_entry, list);
		if (timer_entry->timer == timer) {
			break;
		}
		plist = get_next(plist);
	}
	_tizenrt_mutex_put(&_tizenrt_timer_mutex);

	if (plist == &_tizenrt_timer_table) {
		return;
	}
	timer_entry->timer->live = 0;

	if (timer_entry->timer->function) {
		timer_entry->timer->function(timer);
	}
}

/********************* os depended service ********************/

u8 *_tizenrt_malloc(u32 sz)
{
	return kmm_zalloc(sz);
}

u8 *_tizenrt_zmalloc(u32 sz)
{
	u8 *pbuf = _tizenrt_malloc(sz);

	if (pbuf != NULL) {
		memset(pbuf, 0, sz);
	}

	return pbuf;
}

void _tizenrt_mfree(u8 *pbuf, u32 sz)
{
	/* To avoid gcc warnings */
	(void)sz;

	kmm_free(pbuf);
}

static void _tizenrt_memcpy(void *dst, void *src, u32 sz)
{
	memcpy(dst, src, sz);
}

static int _tizenrt_memcmp(void *dst, void *src, u32 sz)
{
	if (!(memcmp(dst, src, sz))) {
		return 1;
	}

	return 0;
}

static void _tizenrt_memset(void *pbuf, int c, u32 sz)
{
	memset(pbuf, c, sz);
}

static void _tizenrt_init_sema(_sema *sema, int init_val)
{
	if (*sema == NULL) {
		*sema = (_sema) _tizenrt_zmalloc(sizeof(sem_t));
		if (*sema == NULL) {
			rtw_printf("\r\n Failed to kmm_zalloc in %s\n", __FUNCTION__);
			return;
		}
	} else {
		rtw_printf("\r\n already inited %s\n", __FUNCTION__);
		return;
	}
	int ret = sem_init((sem_t *)(*sema), 0, init_val);
	if (ret != OK) {
		rtw_printf("\r\n Failed to sem_init in %s\n", __FUNCTION__);
		_tizenrt_mfree(*sema, sizeof(sem_t));
		return;
	}
}

static void _tizenrt_free_sema(_sema *sema)
{
	int i;
	if (*sema != NULL) {
		i = sem_destroy(*sema);
		if (i == 0) {
			kmm_free(*sema);
		} else {
			rtw_printf(" fail!!! \n");
		}
	}
	*sema = NULL;
}

static void _tizenrt_up_sema(_sema *sema)
{
	sem_post((sem_t *)(*sema));
}

static void _tizenrt_up_sema_from_isr(_sema *sema)
{
	sem_post((sem_t *)(*sema));
}

static u32 _tizenrt_down_sema(_sema *sema, u32 timeout)
{
	struct timespec ts;
	int ret;
	if (timeout == RTW_MAX_DELAY) {
		ret = sem_wait((sem_t *)(*sema));
	} else {
		clock_gettime(CLOCK_REALTIME, &ts);
		ts.tv_sec += timeout / 1000;
		ret = sem_timedwait((sem_t *)(*sema), &ts);
	}
	if (ret != OK) {
		return _FAIL;
	} else {
		return _SUCCESS;
	}
}

static void _tizenrt_mutex_init(_mutex *pmutex)
{
#if USE_PTHREAD_MUTEX
	pthread_mutexattr_t mutex_attr;
	int err;

	if (*pmutex == NULL) {
		*pmutex = _tizenrt_zmalloc(sizeof(pthread_mutex_t));
		if (*pmutex == NULL) {
			ndbg(" failed \n");
			goto err_exit;
		}
	}
	err = pthread_mutexattr_init(&mutex_attr);
	if (err) {
		ndbg("pthread_mutexattr_init failed with error code (%d).", err);
		goto err_exit;
	}
	err = pthread_mutexattr_settype(&mutex_attr, PTHREAD_MUTEX_RECURSIVE);
	if (err) {
		ndbg("pthread_mutexattr_settype failed with error code (%d).", err);
		goto err_exit;
	}
	err = pthread_mutex_init((pthread_mutex_t *)(*pmutex), &mutex_attr);
	if (err) {
		ndbg("pthread_mutex_init failed with error code (%d).", err);
		goto err_exit;
	}
	return;
err_exit:
	if (*pmutex) {
		_tizenrt_mfree(*pmutex);
	}
	return;
#else
	if (*pmutex == NULL) {
		*pmutex = _tizenrt_zmalloc(sizeof(sem_t));
		if (*pmutex == NULL) {
			ndbg(" failed \n");
			return;
		}
	}
	sem_init(*pmutex, 0, 1);
	sem_setprotocol(*pmutex, SEM_PRIO_NONE);
#endif
}

