Samsung/TizenRT/os/board/rtl8721csm/src/component/os/tizenrt/tizenrt_service.c
	if(_tizenrt_timer_mutex == NULL) {
		save_and_cli();
		if(_tizenrt_timer_mutex == NULL) {
			_tizenrt_mutex_init(&_tizenrt_timer_mutex);
			INIT_LIST_HEAD(&_tizenrt_timer_table);
		}
		restore_flags();
	}

	struct _tizenrt_timer_entry *timer_entry;
	timer_entry = _tizenrt_zmalloc(sizeof(struct _tizenrt_timer_entry));
	if (timer_entry == NULL) {
		kmm_free(timer->work_hdl);
		kmm_free(timer);
		return NULL;
	}
	memset(timer_entry, 0, sizeof(struct _tizenrt_timer_entry));
	timer_entry->timer = timer;

	_tizenrt_mutex_get(&_tizenrt_timer_mutex);
	list_add(&(timer_entry->list), &_tizenrt_timer_table);
	_tizenrt_mutex_put(&_tizenrt_timer_mutex);

	return (_timerHandle) timer;
}

u32 _tizenrt_timerDelete(_timerHandle xTimer, osdepTickType xBlockTime)
{
	struct timer_list_priv *timer = (struct timer_list_priv *)xTimer;

	_list *plist;
	struct _tizenrt_timer_entry *timer_entry;

	int ret = work_cancel(LPWORK, timer->work_hdl);
	if (ret != OK && ret != -ENOENT) {
		DBG_ERR(" failed! ret = %d\n", ret);
		return _FAIL;
	}

	_tizenrt_mutex_get(&_tizenrt_timer_mutex);
	plist = get_next(&_tizenrt_timer_table);
	while ((_tizenrt_end_of_queue_search(&_tizenrt_timer_table, plist)) == _FALSE) {
		timer_entry = LIST_CONTAINOR(plist, struct _tizenrt_timer_entry, list);
		if (timer_entry->timer == timer) {
			list_del_init(plist);
			kmm_free(timer_entry);
			break;
		}
		plist = get_next(plist);
	}
	_tizenrt_mutex_put(&_tizenrt_timer_mutex);
	if (plist == &_tizenrt_timer_table) {
		return _FAIL;
	}

	timer->data = NULL;
	timer->timer_hdl = NULL;
	timer->timevalue = 0;
	timer->live = 0;
	kmm_free(timer->work_hdl);
	kmm_free(timer);
	return _SUCCESS;
}

u32 _tizenrt_timerIsTimerActive(_timerHandle xTimer)
{
	struct timer_list_priv *timer = (struct timer_list_priv *)xTimer;

	return timer->live;
}

u32 _tizenrt_timerStop(_timerHandle xTimer, osdepTickType xBlockTime)
{
	struct timer_list_priv *timer = (struct timer_list_priv *)xTimer;

	int ret = work_cancel(LPWORK, timer->work_hdl);
	if (ret != OK && ret != -ENOENT) {
		DBG_ERR(" failed! ret = %d\n", ret);
		return _FAIL;
	}

	timer->timevalue = 0;
	timer->live = 0;
	return _SUCCESS;
}

u32 _tizenrt_timerChangePeriod(_timerHandle xTimer, osdepTickType xNewPeriod, osdepTickType xBlockTime)
{
	int ret;
	struct timer_list_priv *timer = (struct timer_list_priv *)xTimer;
	ret = work_queue(LPWORK, timer->work_hdl, _tizenrt_timer_wrapper, (void *)(timer), xNewPeriod);
	if (ret == -EALREADY) {
		if (work_cancel(LPWORK, timer->work_hdl) != OK) {
			DBG_ERR("Failed!\n");
			return _FAIL;
		}
		if (work_queue(LPWORK, timer->work_hdl, _tizenrt_timer_wrapper, (void *)(timer), xNewPeriod)) {
			DBG_ERR("Failed!\n");
			return _FAIL;
		}
	}
	timer->live = 1;

	return _SUCCESS;
}

void *_tizenrt_timerGetID(_timerHandle xTimer)
{
	struct timer_list_priv *timer = (struct timer_list_priv *)xTimer;
	return timer->data;
}

u32 _tizenrt_timerStart(_timerHandle xTimer, osdepTickType xBlockTime)
{
	rtw_printf("%s %d\r\n", __func__, __LINE__);
	return 0;
}

u32 _tizenrt_timerStartFromISR(_timerHandle xTimer, osdepBASE_TYPE *pxHigherPriorityTaskWoken)
{
	rtw_printf("%s %d\r\n", __func__, __LINE__);
	return 0;
}

u32 _tizenrt_timerStopFromISR(_timerHandle xTimer, osdepBASE_TYPE *pxHigherPriorityTaskWoken)
{
	rtw_printf("%s %d\r\n", __func__, __LINE__);
	return 0;
}

u32 _tizenrt_timerResetFromISR(_timerHandle xTimer, osdepBASE_TYPE *pxHigherPriorityTaskWoken)
{
	rtw_printf("%s %d\r\n", __func__, __LINE__);
	return 0;
}

u32 _tizenrt_timerChangePeriodFromISR(_timerHandle xTimer, osdepTickType xNewPeriod, osdepBASE_TYPE *pxHigherPriorityTaskWoken)
{
	rtw_printf("%s %d\r\n", __func__, __LINE__);
	return 0;
}

u32 _tizenrt_timerReset(_timerHandle xTimer, osdepTickType xBlockTime)
{
	rtw_printf("%s %d\r\n", __func__, __LINE__);
	return 0;
}

void _tizenrt_acquire_wakelock(void)
{
}

void _tizenrt_release_wakelock(void)
{
}

void _tizenrt_wakelock_timeout(uint32_t timeout)
{
}

u8 _tizenrt_get_scheduler_state(void)
{
	rtw_printf("%s %d\r\n", __func__, __LINE__);
	return 0;
}

static IRQ_FUN TizenUserIrqFunTable[MAX_PERIPHERAL_IRQ_NUM];
static int wrapper_IrqFun(int irq, FAR void *context, FAR void *arg)
{
	if (irq < AMEBAD_IRQ_FIRST) {
		rtw_printf("INT %d should not come here\r\n", irq);
		return OK;
	}
	__NVIC_ClearPendingIRQ(irq - AMEBAD_IRQ_FIRST);
	if (TizenUserIrqFunTable[irq - AMEBAD_IRQ_FIRST] != NULL) {
		TizenUserIrqFunTable[irq - AMEBAD_IRQ_FIRST]((VOID *)(arg));
	} else {
		rtw_printf("INT_Entry Irq %d Fun Not Assign!!!!!", irq - AMEBAD_IRQ_FIRST);
	}
	return OK;
}

BOOL irq_register(IRQ_FUN IrqFun, IRQn_Type IrqNum, u32 Data, u32 Priority)
{
	if (IrqNum < 0) {
		rtw_printf("INT %d should not come here\r\n", IrqNum);
		return _TRUE;
	}
	Priority = (Priority >> IRQ_PRIORITY_SHIFT);
	if (IrqNum == WL_DMA_IRQ || IrqNum == WL_PROTOCOL_IRQ) {
		Priority = 4;
	}
	TizenUserIrqFunTable[IrqNum] = (IRQ_FUN)((u32) IrqFun | 0x1);
	Priority = (Priority << (8 - __NVIC_PRIO_BITS));
	irq_attach(IrqNum + AMEBAD_IRQ_FIRST, wrapper_IrqFun, (void *)Data);
	up_prioritize_irq(IrqNum + AMEBAD_IRQ_FIRST, Priority);	//Need to fix, because it can't get the same result as __NVIC_SetPriority
	return _TRUE;
}

BOOL irq_unregister(IRQn_Type IrqNum)
{
	if (IrqNum < 0) {
		rtw_printf("INT %d should not come here\r\n", IrqNum);
		return _TRUE;
	}
	irq_detach(IrqNum);
	TizenUserIrqFunTable[IrqNum] = NULL;
	return _TRUE;
}

void irq_enable(IRQn_Type IrqNum)
{
	if (IrqNum < 0) {
		rtw_printf("INT %d should not come here\r\n", IrqNum);
		return;
	}
	up_enable_irq(IrqNum + AMEBAD_IRQ_FIRST);
}

void irq_disable(IRQn_Type IrqNum)
{
	if (IrqNum < 0) {
		rtw_printf("INT %d should not come here\r\n", IrqNum);
		return;
	}
	up_disable_irq(IrqNum + AMEBAD_IRQ_FIRST);
}

int __wrap_printf(const char *format, ...)
{
	int ret = 0;
	va_list args;
	va_start(args, (const char *)format);
	ret = rtw_printf((const char *)format, args);
	va_end(args);
	return ret;
}

void shell_switch_ipc_int(VOID *Data, u32 IrqStatus, u32 ChanNum)
{
	rtw_printf("%s %d\r\n", __func__, __LINE__);
}

uint32_t *vTaskStackAddr(void)
{
	struct tcb_s *rtcb = this_task();
	/* Get the limits on the user stack memory */
	return (uint32_t *)rtcb->adj_stack_ptr;
}

uint32_t vTaskStackSize(void)
{
	struct tcb_s *rtcb = this_task();
	return (uint32_t)rtcb->adj_stack_size;
}

char * vTaskName(void)
{
	struct tcb_s *rtcb = this_task();
	return (char *)rtcb->name;
}

void vPortEnterCritical(void)
{
	save_and_cli();
}

void vPortExitCritical(void)
{
	restore_flags();
}

void vTaskDelay(int ms)
{
	_tizenrt_mdelay_os(ms);
}
int _tizenrt_printf(const char *format)
{
	vddbg(format, ##__VA_ARGS__);
}
const struct osdep_service_ops osdep_service = {
	_tizenrt_malloc,			//rtw_vmalloc
	_tizenrt_zmalloc,			//rtw_zvmalloc
	_tizenrt_mfree,				//rtw_vmfree
	_tizenrt_malloc,			//rtw_malloc
	_tizenrt_zmalloc,			//rtw_zmalloc
	_tizenrt_mfree,				//rtw_mfree
	_tizenrt_memcpy,			//rtw_memcpy
	_tizenrt_memcmp,			//rtw_memcmp
	_tizenrt_memset,			//rtw_memset
	_tizenrt_init_sema,			//rtw_init_sema
	_tizenrt_free_sema,			//rtw_free_sema
	_tizenrt_up_sema,			//rtw_up_sema
	_tizenrt_up_sema_from_isr,	//rtw_up_sema_from_isr
	_tizenrt_down_sema,			//rtw_down_sema
	_tizenrt_mutex_init,		//rtw_mutex_init
	_tizenrt_mutex_free,		//rtw_mutex_free
	_tizenrt_mutex_get,			//rtw_mutex_get
	_tizenrt_mutex_get_timeout,	//rtw_mutex_get_timeout
	_tizenrt_mutex_put,			//rtw_mutex_put
	_tizenrt_enter_critical,	//rtw_enter_critical
	_tizenrt_exit_critical,		//rtw_exit_critical
	_tizenrt_enter_critical_from_isr,	//rtw_enter_critical_from_isr
	_tizenrt_exit_critical_from_isr,	//rtw_exit_critical_from_isr
	NULL,						//rtw_enter_critical_bh
	NULL,						//rtw_exit_critical_bh
	_tizenrt_enter_critical_mutex,	//rtw_enter_critical_mutex
	_tizenrt_exit_critical_mutex,	//rtw_exit_critical_mutex
	_tizenrt_cpu_lock,
	_tizenrt_cpu_unlock,
	_tizenrt_spinlock_init,		//rtw_spinlock_init
	_tizenrt_spinlock_free,		//rtw_spinlock_free
	_tizenrt_spinlock,			//rtw_spin_lock
	_tizenrt_spinunlock,		//rtw_spin_unlock
	_tizenrt_spinlock_irqsave,	//rtw_spinlock_irqsave
	_tizenrt_spinunlock_irqsave,	//rtw_spinunlock_irqsave
	_tizenrt_init_xqueue,		//rtw_init_xqueue
	_tizenrt_push_to_xqueue,	//rtw_push_to_xqueue
	_tizenrt_pop_from_xqueue,	//rtw_pop_from_xqueue
	_tizenrt_peek_from_xqueue,		//rtw_peek_from_xqueue
	_tizenrt_deinit_xqueue,		//rtw_deinit_xqueue
	_tizenrt_get_current_time,	//rtw_get_current_time
	_tizenrt_systime_to_ms,		//rtw_systime_to_ms
	_tizenrt_systime_to_sec,	//rtw_systime_to_sec
	_tizenrt_ms_to_systime,		//rtw_ms_to_systime
	_tizenrt_sec_to_systime,	//rtw_sec_to_systime
	_tizenrt_msleep_os,			//rtw_msleep_os
	_tizenrt_usleep_os,			//rtw_usleep_os
	_tizenrt_mdelay_os,			//rtw_mdelay_os
	_tizenrt_udelay_os,			//rtw_udelay_os
	_tizenrt_yield_os,			//rtw_yield_os

