Samsung/TizenRT/os/board/rtl8721csm/src/component/os/tizenrt/tizenrt_service.c
	_tizenrt_ATOMIC_SET,		//ATOMIC_SET
	_tizenrt_ATOMIC_READ,		//ATOMIC_READ
	_tizenrt_ATOMIC_ADD,		//ATOMIC_ADD
	_tizenrt_ATOMIC_SUB,		//ATOMIC_SUB
	_tizenrt_ATOMIC_INC,		//ATOMIC_INC
	_tizenrt_ATOMIC_DEC,		//ATOMIC_DEC
	_tizenrt_ATOMIC_ADD_RETURN,	//ATOMIC_ADD_RETURN
	_tizenrt_ATOMIC_SUB_RETURN,	//ATOMIC_SUB_RETURN
	_tizenrt_ATOMIC_INC_RETURN,	//ATOMIC_INC_RETURN
	_tizenrt_ATOMIC_DEC_RETURN,	//ATOMIC_DEC_RETURN

	_tizenrt_modular64,			//rtw_modular64
	_tizenrt_get_random_bytes,	//rtw_get_random_bytes
	_tizenrt_GetFreeHeapSize,	//rtw_getFreeHeapSize

	_tizenrt_create_task,		//rtw_create_task
	_tizenrt_delete_task,		//rtw_delete_task
	NULL,			//rtw_wakeup_task
	_tizenrt_set_priority_task,	//rtw_set_priority_task
	_tizenrt_get_priority_task,	//rtw_get_priority_task
	_tizenrt_suspend_task,			//rtw_suspend_task
	_tizenrt_resume_task,			//rtw_resume_task

	_tizenrt_thread_enter,		//rtw_thread_enter
	_tizenrt_thread_exit,		//rtw_thread_exit

	_tizenrt_timerCreate,		//rtw_timerCreate,
	_tizenrt_timerDelete,		//rtw_timerDelete,
	_tizenrt_timerIsTimerActive,	//rtw_timerIsTimerActive,
	_tizenrt_timerStop,			//rtw_timerStop,
	_tizenrt_timerChangePeriod,	//rtw_timerChangePeriod
	_tizenrt_timerGetID,		//rtw_timerGetID
	_tizenrt_timerStart,		//rtw_timerStart
	_tizenrt_timerStartFromISR,	//rtw_timerStartFromISR
	_tizenrt_timerStopFromISR,	//rtw_timerStopFromISR
	_tizenrt_timerResetFromISR,	//rtw_timerResetFromISR
	_tizenrt_timerChangePeriodFromISR,	//rtw_timerChangePeriodFromISR
	_tizenrt_timerReset,		//rtw_timerReset

	_tizenrt_acquire_wakelock,	//rtw_acquire_wakelock
	_tizenrt_release_wakelock,	//rtw_release_wakelock
	_tizenrt_wakelock_timeout,	//rtw_wakelock_timeout
	_tizenrt_get_scheduler_state,	//rtw_get_scheduler_state
	NULL,						// rtw_create_secure_context
	NULL,						//rtw_get_current_TaskHandle
};
